# AsDouble Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyType..::..AsDouble Method
FamilyType Class See Also
---
Provides access to the double precision number of the given family parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Nullable<double> AsDouble(
	FamilyParameter familyParameter
)
```

Visual Basic
---
```text
Public Function AsDouble ( _
	familyParameter As FamilyParameter _
) As Nullable(Of Double)
```

Visual C++
---
```text
public:
Nullable<double> AsDouble(
	FamilyParameter^ familyParameter
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameter
# ### Return Value
The double value contained in the parameter. Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the storage type of the input argument is not double type or this parameter has no value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the input argument-"familyParameter"-is invalid, |

# See Also
FamilyType Class
Autodesk.Revit.DB Namespace